Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Shared broker
es_es: Broker compartido

source: Shared cluster
es_es: Clúster compartido

source: Shared registry
es_es: Registro compartido

source: Shared server
es_es: Servidor compartido

source: Short informative videos that highlight unique technical points and instructions on how to get the most out of Quarkus.
es_es: Vídeos informativos cortos que destacan puntos técnicos únicos e instrucciones sobre cómo sacar el máximo partido a Quarkus.

source: Should I Use Funqy?
es_es: ¿Debo usar Funqy?

source: Simplified MongoDB with Panache and Kotlin
es_es: MongoDB simplificado con Panache y Kotlin

source: Since we’re not limited to standards we can go beyond and extend your possibilities. Of course, Quarkus is not a passive consumer. Our goal is to improve and innovate the technologies we use and contribute back to the open source projects and standards we rely on.
es_es: Como no estamos limitados a los estándares, podemos ir más allá y ampliar sus posibilidades. Por supuesto, Quarkus no es un consumidor pasivo. Nuestro objetivo es mejorar e innovar las tecnologías que utilizamos y contribuir a los proyectos de código abierto y a los estándares en los que confiamos.

source: Single-step Deployments
es_es: Despliegues de un solo paso

source: Size
es_es: Tamaño

source: So join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, well, have more fun: 90 odd minutes of technical discussion, some live coding and a Q&A - it’s going to be a blast.
es_es: Acompáñanos a explorar cómo Quarkus ayuda a los desarrolladores Java de todo el mundo a ser más productivos, crear obras maestras modernas y, bueno, divertirse más: 90 minutos de debate técnico, codificación en directo y preguntas y respuestas: va a ser la bomba.

source: Solution
es_es: Solución

source: Sometimes you need more than just handling messages one by one. You can also express your message processing logic using reactive programming as illustrated in the following snippet:
es_es: A veces se necesita algo más que manejar los mensajes uno a uno. También puede expresar su lógica de procesamiento de mensajes utilizando la programación reactiva, como se ilustra en el siguiente fragmento:

source: Source
es_es: Fuente

source: Specify the failure strategy to apply when a message produced from an AMQP message is nacked. Accepted values are `fail` (default), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_
es_es: Especifica la estrategia de fallo a aplicar cuando un mensaje producido a partir de un mensaje AMQP es nacked. Los valores aceptados son `fail` (por defecto), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_

source: Spring Cloud Config Client Reference
es_es: Referencia del cliente Spring Cloud Config

source: Stable
es_es: Estable

source: Stand up a Config Server
es_es: Poner en marcha un servidor de configuración

source: Start the xref:getting-started.adoc[Getting Started] application (or any other application) using:
es_es: Inicie la aplicación xref:getting-started.html["Getting Started] " (o cualquier otra aplicación) utilizando:

source: Start with Serverless
es_es: Empezar con el Serverless

source: Status
es_es: Estatus

source: Step <span class="step-no">1</span>
es_es: Paso <span class="step-no">1</span>

source: Step <span class="step-no">2</span>
es_es: Paso <span class="step-no">2</span>

source: Step <span class="step-no">3</span>
es_es: Paso <span class="step-no">3</span>

source: Step <span class="step-no">4</span>
es_es: Paso <span class="step-no">4</span>

source: Streamlined code for the 80% common usages, flexible for the 20%
es_es: Código racionalizado para el 80% de los usos comunes, flexible para el 20%

source: Subscribe to the <a href="{{site.baseurl}}/newsletter">monthly newsletter</a> to have choice Quarkus content from across our community delivered to your inbox.
es_es: Suscríbase al <a href="{{site.baseurl}}/newsletter">boletín mensual</a> para recibir en su bandeja de entrada los contenidos de Quarkus más destacados de nuestra comunidad.

source: Supported Versions
es_es: Versiones compatibles

source: Swagger UI
es_es: Interfaz de usuario de Swagger

source: System vs. Container
es_es: Sistema vs. Contenedor

source: Test Security Extension
es_es: Probar la extensión de seguridad

source: Testing
es_es: Probando

source: Testing locally
es_es: Pruebas locales

source: Thankfully, when using the `kubernetes-config` extension along with the xref:deploying-to-kubernetes.adoc[Kubernetes] extension, all the necessary Kubernetes resources to make that happen are automatically generated.
es_es: Afortunadamente, cuando se utiliza la extensión `kubernetes-config` junto con la extensión xref:deploying-to-kubernetes.html[Kubernetes], se generan automáticamente todos los recursos Kubernetes necesarios para que esto ocurra.

source: Thanks goes to these wonderful people:
es_es: Gracias a estas maravillosas personas:

source: Thanks to the <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , you can compose asynchronous operations and complete the result when everything is done without blocking the I/O threads. This greatly improves resource consumption and elasticity. Most Quarkus APIs are available in both imperative and reactive. As example, you can use the reactive version of the REST Client:
es_es: Gracias a la <a href="https://quarkus.io/version/main/guides/mutiny-primer">API Reactiva de Mutiny</a> , puedes componer operaciones asíncronas y completar el resultado cuando todo esté hecho sin bloquear los hilos de E/S. Esto mejora mucho el consumo de recursos y la elasticidad. La mayoría de las APIs de Quarkus están disponibles tanto en imperativo como en reactivo. Como ejemplo, puede utilizar la versión reactiva del Cliente REST:

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus to be used in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
es_es: Gracias a su tiempo de inicio estelar y su bajo uso de memoria, puedes implementar funciones usando Quarkus para ser utilizadas en entornos sin servidor. Quarkus proporciona Funqy, un enfoque para escribir funciones que se pueden desplegar en varios entornos FaaS como AWS Lambda, Azure Functions, Knative y Knative Events (Cloud Events). También se puede utilizar como un servicio independiente.

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
es_es: Los grupos de Google de <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev</a>

source: The <a href="https://quarkus.io">English version of quarkus.io</a> is the official project site. Translated sites are community supported on a best-effort basis.
es_es: La <a href="https://quarkus.io">versión en inglés de quarkus.io</a> es el sitio oficial del proyecto. Los sitios traducidos son apoyados por la comunidad sobre una base del mejor esfuerzo.

source: The <code>@Incoming</code> and <code>@Outgoing</code> annotations are part of <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. They are used to express from which <em>channel</em> you are consuming and to which <em>channel</em> you are sending. Thanks to Reactive Messaging you can consume and send messages from and to different brokers and transports such as HTTP, Kafka, or <a href="http://camel.apache.org">Apache Camel</a>.
es_es: Las anotaciones <code>@Incoming</code> y <code>@Outgoing</code> forman parte de <a href="https://www.smallrye.io/smallrye-reactive-messaging">Mensajería Reactiva</a>. Se utilizan para expresar desde qué <em>canal</em>estás consumiendo y a qué <em>canal</em> estás enviando. Gracias a la Mensajería Reactiva puedes consumir y enviar mensajes desde y hacia diferentes brokers y transportes como HTTP, Kafka, o <a href="http://camel.apache.org">Apache Camel</a>.

source: The AMQP address. If not set, the channel name is used Type: _string_
es_es: La dirección AMQP. Si no se establece, se utiliza el nombre del canal Type: _string_

source: The AMQP container id Type: _string_
es_es: El id del contenedor AMQP Type: _string_

source: The Batch API and Runtime will be available out of the box. Please refer to the <a href="#">Batch documentation</a>, or the <a href="#">JBeret documentation</a> to learn about Batch Applications.
es_es: La API de Batch y Runtime estarán disponibles de forma inmediata. Consulte la <a href="#">documentación de Batch</a>, o la <a href="#">documentación de JBeret</a> para conocer sobre las aplicaciones Batch.

source: The Batch API requires the @BatchProperty annotation to inject the specific configuration from the batch definition file. Instead, you can use the @ConfigProperty annotation, which is used to inject configuration properties in Quarkus using the MicroProfile Config API and keep consistency:
es_es: La API de Batch requiere la anotación @BatchProperty para inyectar la configuración específica del archivo de definición. En su lugar, se puede utilizar la anotación @ConfigProperty, que se utiliza para inyectar propiedades de configuración en Quarkus utilizando la API MicroProfile Config y mantener la coherencia:

source: The Batch APIs JobOperator and JobRepository are available as CDI beans, so they can be injected directly into any code:
es_es: Las APIs JobOperator y JobRepository están disponibles como beans CDI, por lo que pueden ser inyectadas directamente en cualquier código:

source: The CDI name of the handler class must match the value specified within the `quarkus.lambda.handler` property.
es_es: El nombre CDI de la clase manejadora debe coincidir con el valor especificado en la propiedad `quarkus.lambda.handler`.

source: The Challenge
es_es: El desafío

source: The Cloud Event link:https://cloudevents.io/[specification] is a good read to give you an even greater understanding of Knative Events.
es_es: La link:https://cloudevents.io/[especificación de] los eventos en la nube es una buena lectura para que comprenda mejor los eventos de Knative.

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how are written the cloud events in the outgoing record Type: _string_
es_es: El modo de eventos en la nube ( `structured` o `binary` (por defecto)). Indica cómo se escriben los eventos de la nube en el registro de salida Type: _string_

source: The Code
es_es: El Código

source: The Dev UI is not available when running in continuous testing mode, as this is provided by dev mode.
es_es: La interfaz de usuario de desarrollo no está disponible cuando se ejecuta en el modo de pruebas continuas, ya que esto es proporcionado por el modo de desarrollo.

source: The Funqy HTTP endpoint
es_es: El endpoints HTTP de Funqy

source: The Gradle extension plugin is still experimental and may change in the future.
es_es: El plugin de extensión de Gradle es todavía experimental y puede cambiar en el futuro.

source: The HTML page
es_es: La página HTML

source: The JBeret Quarkus extension supports the following configuration:
es_es: La extensión JBeret Quarkus soporta la siguiente configuración:

source: The JBeret REST API, provides REST resources to several operations around the Batch API: starting and stopping jobs, querying the status of a job, schedule a job, and many more. The extension includes a REST client to simplify the REST API calls:
es_es: La API REST de JBeret, proporciona recursos REST para varias operaciones en torno a la API Batch: iniciar y detener trabajos, consultar el estado de un trabajo, programar un trabajo, y muchas más. La extensión incluye un cliente REST para simplificar las llamadas a la API REST:

source: The JBeret REST is integrated as separate extension that can be easily added to the target project with the following dependency:
es_es: El JBeret REST está integrado como una extensión separada que se puede añadir fácilmente al proyecto de destino con la siguiente dependencia:

source: The JBeret Scheduler is integrated out of the box in this extension.
es_es: El planificador JBeret está integrado en esta extensión.

source: The JobScheduler does not support persistent schedules.
es_es: El JobScheduler no admite las programaciones persistentes.

source: The Kogito Dev Service will be enabled when either `kogito-quarkus` or `kogito-quarkus-processes` extension is present in your application. More information can be found at the xref:kogito-dev-services.adoc[Kogito Dev Services Guide].
es_es: El Kogito Dev Service se activará cuando la extensión `kogito-quarkus` o `kogito-quarkus-processes` esté presente en su aplicación. Puede encontrar más información en la xref:kogito-dev-services.html[Guía de Servicios de Desarrollo] de Kogito.

source: The Quarkus JBeret Extension adds support for JSR-352 Batch Applications for the Java Platform. JBeret is an implementation of the JSR-352.
es_es: La extensión JBeret de Quarkus añade soporte para las aplicaciones por lotes JSR-352 para la plataforma Java. JBeret es una implementación de la JSR-352.

source: The Quarkus Kubernetes will bind the HTTP server using the port name `http` and the gRPC server using the port name `grpc`. By default, the Quarkus application will only expose the port name `http`, so only the HTTP server will be publicly accessible. To expose the gRPC server instead, set the `quarkus.kubernetes.ingress.target-port=grpc` property in your application.properties:
es_es: Quarkus Kubernetes enlazará el servidor HTTP utilizando el nombre de puerto `http` y el servidor gRPC utilizando el nombre de puerto `grpc`. Por defecto, la aplicación Quarkus sólo expondrá el nombre de puerto `http`, por lo que sólo el servidor HTTP será accesible públicamente. Para exponer el servidor gRPC en su lugar, establezca la propiedad `quarkus.kubernetes.ingress.target-port=grpc` en su application.properties:

source: The Quarkus community publishes thoughtful how-to videos to help you get started. Check them out on <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.
es_es: La comunidad de Quarkus publica vídeos explicativos para ayudarte a empezar. Consúltalos en <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.

source: The Quarkus team and community take all security bugs very seriously. You can find our guidelines here regarding our policy and security disclosure.
es_es: El equipo y la comunidad de Quarkus se toman muy en serio todos los errores de seguridad. Puede encontrar nuestras pautas aquí con respecto a nuestra política y divulgación de seguridad.

source: The Quickstart
es_es: El inicio rápido

source: The Quickstart Flow
es_es: El flujo de inicio rápido

source: The Quote object
es_es: El objeto Cotización

source: The Reactive Messaging AMQP connector
es_es: El conector AMQP de mensajería reactiva

source: The Reactive Routes endpoint
es_es: El endpoints de las rutas reactivas

source: The Servlet endpoint
es_es: El endpoints del Servlet

source: The UPX compression requires:
es_es: La compresión UPX requiere:

source: The URL can now be updated during the deployment or at launch time using system properties or environment variables.
es_es: Ahora se puede actualizar la URL durante el despliegue o en el momento del lanzamiento utilizando las propiedades del sistema o las variables de entorno.

source: The `--classpath` parameter needs to be set to the previously packaged JAR that contains your function class and all Quarkus related classes.
es_es: El parámetro `--classpath` necesita ser establecido en el JAR previamente empaquetado que contiene su clase de función y todas las clases relacionadas con Quarkus.

source: The `Price` instances are automatically encoded to JSON by the connector
es_es: Las instancias de `Price` son codificadas automáticamente en JSON por el conector

source: The `mapTo` method uses the Quarkus Jackson mapper. Check xref:rest-json.adoc#json[this guide] to learn more about the mapper configuration.
es_es: El método `mapTo` utiliza el mapeador Quarkus Jackson. Consulta xref:rest-json.html#json[esta guía] para saber más sobre la configuración del mapeador.

source: The `process` method is called for every AMQP message from the `quote-requests` queue, and will send a `Quote` object to the `quotes` queue.
es_es: El método `process` es llamado por cada mensaje AMQP de la cola `quote-requests`, y enviará un objeto `Quote` a la cola `quotes`.

source: The `quarkus-smallrye-health` extension will expose the Health UI when Quarkus is running in dev-mode. xref:smallrye-health.adoc#ui[This] section provides additional information.
es_es: La extensión `quarkus-smallrye-health` expondrá la interfaz de usuario de salud cuando Quarkus se ejecute en modo de desarrollo. xref:smallrye-health.html#ui[Esta] sección proporciona información adicional.

source: The `quarkus-smallrye-openapi` extension will expose the Swagger UI when Quarkus is running in dev-mode. Additional information can be found xref:openapi-swaggerui.adoc#dev-mode[here].
es_es: La extensión `quarkus-smallrye-openapi` expondrá la interfaz de usuario Swagger cuando Quarkus se ejecute en modo dev. Se puede encontrar información xref:openapi-swaggerui.html#dev-mode[aquí].

source: The advantage of pushing a whole container is that we are in complete control over its content and maybe even choose to deploy a container with a native executable running on GraalVM.
es_es: La ventaja de subir un contenedor completo es que tenemos un control total sobre su contenido y podemos incluso elegir desplegar un contenedor con un ejecutable nativo que se ejecute en GraalVM.

source: The application is packaged using:
es_es: La aplicación se empaqueta con:

source: The application will have a generated name and the terminal should output that. `heroku open` opens your default browser to access your new application.
es_es: La aplicación tendrá un nombre generado y el terminal debería mostrarlo. `heroku open` abre su navegador por defecto para acceder a su nueva aplicación.

source: The benefit of this approach, is that it can be combined with OpenShift's `DeploymentConfig` that makes it easy to roll out changes to the cluster.
es_es: La ventaja de este enfoque es que puede combinarse con el sitio web de OpenShift `DeploymentConfig`, que facilita la introducción de cambios en el clúster.

source: The broker hostname Type: _string_
es_es: El nombre de host del broker Type: _string_

source: The broker port Type: _int_
es_es: El puerto del corredor Type: _int_

source: The central idea behind Quarkus is to do at build-time what traditional frameworks do at runtime: configuration parsing, classpath scanning, feature toggle based on classloading, and so on.
es_es: La idea central de Quarkus es hacer en tiempo de compilación lo que los frameworks tradicionales hacen en tiempo de ejecución: análisis de la configuración, escaneo del classpath, conmutación de funciones basada en la carga de clases, etc.

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
es_es: La combinación de Quarkus y Kubernetes proporciona un entorno ideal para crear aplicaciones escalables, rápidas y ligeras. Quarkus aumenta significativamente la productividad de los desarrolladores con herramientas, integraciones preconstruidas, servicios de aplicaciones y mucho más.

source: The command above, if run successfully, will give you the address of your container in the Cloud. Access your Quarkus application in the address displayed as output.
es_es: El comando anterior, si se ejecuta con éxito, le dará la dirección de su contenedor en la Nube. Acceda a su aplicación Quarkus en la dirección mostrada como salida.

source: The community will fix security bugs for the latest major.minor version published at https://quarkus.io/get-started/.
es_es: La comunidad corregirá los errores de seguridad para la última versión major.minor publicada en [https://quarkus.io/get-started/](https://quarkus.io/get-started/).

source: The completed greeter application from the xref:getting-started.adoc[Getting Started Guide]
es_es: La aplicación de bienvenida completada de la xref:getting-started.html[Guía de Inicio]

source: The compression level goes from 1 to 10:
es_es: El nivel de compresión va de 1 a 10:

source: The condition which triggers activation of an extension is configured in the extension's descriptor, which is included into the runtime artifact of the extension as `META-INF/quarkus-extension.properties`. Given that extension descriptor is generated by the Quarkus plugin at extension build time, extension developers can add the following configuration to express the condition which would have to be satisfied for the extension to be activated:
es_es: La condición que desencadena la activación de una extensión se configura en el descriptor de la extensión, que se incluye en el artefacto de tiempo de ejecución de la extensión como `META-INF/quarkus-extension.properties`. Dado que el descriptor de la extensión es generado por el plugin de Quarkus en el momento de la construcción de la extensión, los desarrolladores de la extensión pueden añadir la siguiente configuración para expresar la condición que tendría que ser satisfecha para que la extensión sea activada:

source: The configuration keys are structured as follows:
es_es: Las claves de configuración están estructuradas de la siguiente manera:

source: The connection timeout in milliseconds Type: _int_
es_es: El tiempo de espera de la conexión en milisegundos Type: _int_

source: The core foundation of every good open source project is open discussion and collaboration. Quarkus is committed to this belief. We've enabled GitHub Discussions so the community can have open communication. This gives a focal point for the community to ask and answer questions regarding the project. This means all of that great knowledge can be shared and is discoverable. Additionally, other conversations about the Quarkus Community can be had there as well. Come collaborate with us.
es_es: La base de todo buen proyecto de código abierto es el debate abierto y la colaboración. Quarkus está comprometido con esta creencia. Hemos habilitado GitHub Discussions para que la comunidad pueda tener una comunicación abierta. Esto da un punto focal para que la comunidad pregunte y responda a las preguntas relacionadas con el proyecto. Esto significa que todo ese gran conocimiento puede ser compartido y es descubrible. Además, otras conversaciones sobre la Comunidad Quarkus se pueden tener allí también. Ven a colaborar con nosotros.

source: The corresponding `requiresIf` element is also supported.
es_es: También se admite el elemento correspondiente `requiresIf`.

source: The default object lifecycle for a Funqy class is `@Dependent`.
es_es: El ciclo de vida del objeto por defecto para una clase Funqy es `@Dependent`.

source: The easiest way to create a new Quarkus project is to open a terminal and run the following command:
es_es: La forma más fácil de crear un nuevo proyecto de Quarkus es abrir un terminal y ejecutar el siguiente comando:

source: The easiest way to locally test your function is using the Cloud Function invoker JAR.
es_es: La forma más fácil de probar localmente su función es utilizando el JAR invocador de funciones en la nube.
